; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-3-5-9)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	p2-1 - location
	p2-8 - location
	p3-0 - location
	p3-5 - location
	p3-6 - location
	p3-9 - location
	p5-0 - location
	p5-1 - location
	p5-4 - location
	p5-8 - location
	p7-1 - location
	p7-2 - location
	p7-4 - location
	p8-6 - location
	p8-7 - location
	p9-2 - location
	)
	(:init
	(at driver1 s5)
	(at driver2 s6)
	(at driver3 s4)
	(at truck1 s8)
	(empty truck1)
	(at truck2 s7)
	(empty truck2)
	(at truck3 s4)
	(empty truck3)
	(at truck4 s2)
	(empty truck4)
	(at truck5 s8)
	(empty truck5)
	(at package1 s1)
	(at package2 s5)
	(at package3 s2)
	(at package4 s8)
	(at package5 s9)
	(at package6 s3)
	(at package7 s0)
	(at package8 s8)
	(at package9 s4)
	(path s2 p2-1)
	(path p2-1 s2)
	(path s1 p2-1)
	(path p2-1 s1)
	(= (time-to-walk s2 p2-1) 23)
	(= (time-to-walk p2-1 s2) 23)
	(= (time-to-walk s1 p2-1) 9)
	(= (time-to-walk p2-1 s1) 9)
	(path s2 p2-8)
	(path p2-8 s2)
	(path s8 p2-8)
	(path p2-8 s8)
	(= (time-to-walk s2 p2-8) 12)
	(= (time-to-walk p2-8 s2) 12)
	(= (time-to-walk s8 p2-8) 40)
	(= (time-to-walk p2-8 s8) 40)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(= (time-to-walk s3 p3-0) 23)
	(= (time-to-walk p3-0 s3) 23)
	(= (time-to-walk s0 p3-0) 52)
	(= (time-to-walk p3-0 s0) 52)
	(path s3 p3-5)
	(path p3-5 s3)
	(path s5 p3-5)
	(path p3-5 s5)
	(= (time-to-walk s3 p3-5) 47)
	(= (time-to-walk p3-5 s3) 47)
	(= (time-to-walk s5 p3-5) 77)
	(= (time-to-walk p3-5 s5) 77)
	(path s3 p3-6)
	(path p3-6 s3)
	(path s6 p3-6)
	(path p3-6 s6)
	(= (time-to-walk s3 p3-6) 70)
	(= (time-to-walk p3-6 s3) 70)
	(= (time-to-walk s6 p3-6) 88)
	(= (time-to-walk p3-6 s6) 88)
	(path s3 p3-9)
	(path p3-9 s3)
	(path s9 p3-9)
	(path p3-9 s9)
	(= (time-to-walk s3 p3-9) 1)
	(= (time-to-walk p3-9 s3) 1)
	(= (time-to-walk s9 p3-9) 40)
	(= (time-to-walk p3-9 s9) 40)
	(path s5 p5-0)
	(path p5-0 s5)
	(path s0 p5-0)
	(path p5-0 s0)
	(= (time-to-walk s5 p5-0) 84)
	(= (time-to-walk p5-0 s5) 84)
	(= (time-to-walk s0 p5-0) 85)
	(= (time-to-walk p5-0 s0) 85)
	(path s5 p5-1)
	(path p5-1 s5)
	(path s1 p5-1)
	(path p5-1 s1)
	(= (time-to-walk s5 p5-1) 77)
	(= (time-to-walk p5-1 s5) 77)
	(= (time-to-walk s1 p5-1) 41)
	(= (time-to-walk p5-1 s1) 41)
	(path s5 p5-4)
	(path p5-4 s5)
	(path s4 p5-4)
	(path p5-4 s4)
	(= (time-to-walk s5 p5-4) 82)
	(= (time-to-walk p5-4 s5) 82)
	(= (time-to-walk s4 p5-4) 62)
	(= (time-to-walk p5-4 s4) 62)
	(path s5 p5-8)
	(path p5-8 s5)
	(path s8 p5-8)
	(path p5-8 s8)
	(= (time-to-walk s5 p5-8) 35)
	(= (time-to-walk p5-8 s5) 35)
	(= (time-to-walk s8 p5-8) 16)
	(= (time-to-walk p5-8 s8) 16)
	(path s7 p7-1)
	(path p7-1 s7)
	(path s1 p7-1)
	(path p7-1 s1)
	(= (time-to-walk s7 p7-1) 30)
	(= (time-to-walk p7-1 s7) 30)
	(= (time-to-walk s1 p7-1) 74)
	(= (time-to-walk p7-1 s1) 74)
	(path s7 p7-2)
	(path p7-2 s7)
	(path s2 p7-2)
	(path p7-2 s2)
	(= (time-to-walk s7 p7-2) 20)
	(= (time-to-walk p7-2 s7) 20)
	(= (time-to-walk s2 p7-2) 77)
	(= (time-to-walk p7-2 s2) 77)
	(path s7 p7-4)
	(path p7-4 s7)
	(path s4 p7-4)
	(path p7-4 s4)
	(= (time-to-walk s7 p7-4) 99)
	(= (time-to-walk p7-4 s7) 99)
	(= (time-to-walk s4 p7-4) 6)
	(= (time-to-walk p7-4 s4) 6)
	(path s8 p8-6)
	(path p8-6 s8)
	(path s6 p8-6)
	(path p8-6 s6)
	(= (time-to-walk s8 p8-6) 74)
	(= (time-to-walk p8-6 s8) 74)
	(= (time-to-walk s6 p8-6) 15)
	(= (time-to-walk p8-6 s6) 15)
	(path s8 p8-7)
	(path p8-7 s8)
	(path s7 p8-7)
	(path p8-7 s7)
	(= (time-to-walk s8 p8-7) 48)
	(= (time-to-walk p8-7 s8) 48)
	(= (time-to-walk s7 p8-7) 97)
	(= (time-to-walk p8-7 s7) 97)
	(path s9 p9-2)
	(path p9-2 s9)
	(path s2 p9-2)
	(path p9-2 s2)
	(= (time-to-walk s9 p9-2) 20)
	(= (time-to-walk p9-2 s9) 20)
	(= (time-to-walk s2 p9-2) 71)
	(= (time-to-walk p9-2 s2) 71)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 5)
	(= (time-to-drive s2 s0) 5)
	(link s0 s3)
	(link s3 s0)
	(= (time-to-drive s0 s3) 32)
	(= (time-to-drive s3 s0) 32)
	(link s0 s6)
	(link s6 s0)
	(= (time-to-drive s0 s6) 11)
	(= (time-to-drive s6 s0) 11)
	(link s0 s7)
	(link s7 s0)
	(= (time-to-drive s0 s7) 28)
	(= (time-to-drive s7 s0) 28)
	(link s0 s9)
	(link s9 s0)
	(= (time-to-drive s0 s9) 83)
	(= (time-to-drive s9 s0) 83)
	(link s1 s0)
	(link s0 s1)
	(= (time-to-drive s1 s0) 57)
	(= (time-to-drive s0 s1) 57)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 4)
	(= (time-to-drive s2 s1) 4)
	(link s1 s3)
	(link s3 s1)
	(= (time-to-drive s1 s3) 52)
	(= (time-to-drive s3 s1) 52)
	(link s1 s7)
	(link s7 s1)
	(= (time-to-drive s1 s7) 45)
	(= (time-to-drive s7 s1) 45)
	(link s1 s8)
	(link s8 s1)
	(= (time-to-drive s1 s8) 4)
	(= (time-to-drive s8 s1) 4)
	(link s2 s9)
	(link s9 s2)
	(= (time-to-drive s2 s9) 91)
	(= (time-to-drive s9 s2) 91)
	(link s3 s2)
	(link s2 s3)
	(= (time-to-drive s3 s2) 28)
	(= (time-to-drive s2 s3) 28)
	(link s3 s7)
	(link s7 s3)
	(= (time-to-drive s3 s7) 88)
	(= (time-to-drive s7 s3) 88)
	(link s3 s9)
	(link s9 s3)
	(= (time-to-drive s3 s9) 68)
	(= (time-to-drive s9 s3) 68)
	(link s4 s1)
	(link s1 s4)
	(= (time-to-drive s4 s1) 69)
	(= (time-to-drive s1 s4) 69)
	(link s4 s8)
	(link s8 s4)
	(= (time-to-drive s4 s8) 70)
	(= (time-to-drive s8 s4) 70)
	(link s5 s1)
	(link s1 s5)
	(= (time-to-drive s5 s1) 29)
	(= (time-to-drive s1 s5) 29)
	(link s6 s9)
	(link s9 s6)
	(= (time-to-drive s6 s9) 3)
	(= (time-to-drive s9 s6) 3)
	(link s7 s5)
	(link s5 s7)
	(= (time-to-drive s7 s5) 86)
	(= (time-to-drive s5 s7) 86)
	(link s8 s2)
	(link s2 s8)
	(= (time-to-drive s8 s2) 58)
	(= (time-to-drive s2 s8) 58)
	(link s8 s3)
	(link s3 s8)
	(= (time-to-drive s8 s3) 76)
	(= (time-to-drive s3 s8) 76)
	(link s8 s6)
	(link s6 s8)
	(= (time-to-drive s8 s6) 6)
	(= (time-to-drive s6 s8) 6)
	(link s9 s4)
	(link s4 s9)
	(= (time-to-drive s9 s4) 35)
	(= (time-to-drive s4 s9) 35)
	(link s9 s8)
	(link s8 s9)
	(= (time-to-drive s9 s8) 75)
	(= (time-to-drive s8 s9) 75)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver1 s5)
	(at driver3 s3)
	(at truck1 s4)
	(at truck2 s8)
	(at truck3 s9)
	(at truck4 s8)
	(at package1 s3)
	(at package2 s1)
	(at package3 s6)
	(at package4 s3)
	(at package5 s8)
	(at package6 s6)
	(at package7 s4)
	(at package8 s9)
	(at package9 s2)
	))

(:metric minimize (+ (+ (* 1  (total-time)) (* 1  (driven))) (* 4  (walked))))

)

; plan
1. (board-truck driver3 truck3 s4)
   deleted: (at driver3 s4) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 1 of 15
2. (load-truck package9 truck3 s4)
   deleted: (at package9 s4)
   added: (in package9 truck3)
   goals met: 1 of 15
3. (drive-truck truck3 s4 s1 driver3)
   deleted: (at truck3 s4)
   added: (at truck3 s1)
   changed: (driven) from 0 to 69
   goals met: 1 of 15
4. (load-truck package1 truck3 s1)
   deleted: (at package1 s1)
   added: (in package1 truck3)
   goals met: 1 of 15
5. (drive-truck truck3 s1 s3 driver3)
   deleted: (at truck3 s1)
   added: (at truck3 s3)
   changed: (driven) from 69 to 121
   goals met: 1 of 15
6. (load-truck package6 truck3 s3)
   deleted: (at package6 s3)
   added: (in package6 truck3)
   goals met: 1 of 15
7. (unload-truck package1 truck3 s3)
   deleted: (in package1 truck3)
   added: (at package1 s3)
   goals met: 2 of 15
8. (drive-truck truck3 s3 s1 driver3)
   deleted: (at truck3 s3)
   added: (at truck3 s1)
   changed: (driven) from 121 to 173
   goals met: 2 of 15
9. (drive-truck truck3 s1 s5 driver3)
   deleted: (at truck3 s1)
   added: (at truck3 s5)
   changed: (driven) from 173 to 202
   goals met: 2 of 15
10. (load-truck package2 truck3 s5)
   deleted: (at package2 s5)
   added: (in package2 truck3)
   goals met: 2 of 15
11. (drive-truck truck3 s5 s7 driver3)
   deleted: (at truck3 s5)
   added: (at truck3 s7)
   changed: (driven) from 202 to 288
   goals met: 2 of 15
12. (drive-truck truck3 s7 s0 driver3)
   deleted: (at truck3 s7)
   added: (at truck3 s0)
   changed: (driven) from 288 to 316
   goals met: 2 of 15
13. (load-truck package7 truck3 s0)
   deleted: (at package7 s0)
   added: (in package7 truck3)
   goals met: 2 of 15
14. (drive-truck truck3 s0 s6 driver3)
   deleted: (at truck3 s0)
   added: (at truck3 s6)
   changed: (driven) from 316 to 327
   goals met: 2 of 15
15. (walk driver2 s6 p8-6)
   deleted: (at driver2 s6)
   added: (at driver2 p8-6)
   changed: (walked) from 0 to 15
   goals met: 2 of 15
16. (drive-truck truck3 s6 s0 driver3)
   deleted: (at truck3 s6)
   added: (at truck3 s0)
   changed: (driven) from 327 to 338
   goals met: 2 of 15
17. (drive-truck truck3 s0 s3 driver3)
   deleted: (at truck3 s0)
   added: (at truck3 s3)
   changed: (driven) from 338 to 370
   goals met: 2 of 15
18. (walk driver2 p8-6 s8)
   deleted: (at driver2 p8-6)
   added: (at driver2 s8)
   changed: (walked) from 15 to 89
   goals met: 2 of 15
19. (walk driver2 s8 p8-7)
   deleted: (at driver2 s8)
   added: (at driver2 p8-7)
   changed: (walked) from 89 to 137
   goals met: 2 of 15
20. (drive-truck truck3 s3 s9 driver3)
   deleted: (at truck3 s3)
   added: (at truck3 s9)
   changed: (driven) from 370 to 438
   goals met: 3 of 15
21. (load-truck package5 truck3 s9)
   deleted: (at package5 s9)
   added: (in package5 truck3)
   goals met: 3 of 15
22. (drive-truck truck3 s9 s8 driver3)
   deleted: (at truck3 s9)
   added: (at truck3 s8)
   changed: (driven) from 438 to 513
   goals met: 2 of 15
23. (unload-truck package5 truck3 s8)
   deleted: (in package5 truck3)
   added: (at package5 s8)
   goals met: 3 of 15
24. (load-truck package4 truck3 s8)
   deleted: (at package4 s8)
   added: (in package4 truck3)
   goals met: 3 of 15
25. (load-truck package8 truck3 s8)
   deleted: (at package8 s8)
   added: (in package8 truck3)
   goals met: 3 of 15
26. (drive-truck truck3 s8 s4 driver3)
   deleted: (at truck3 s8)
   added: (at truck3 s4)
   changed: (driven) from 513 to 583
   goals met: 3 of 15
27. (unload-truck package7 truck3 s4)
   deleted: (in package7 truck3)
   added: (at package7 s4)
   goals met: 4 of 15
28. (drive-truck truck3 s4 s9 driver3)
   deleted: (at truck3 s4)
   added: (at truck3 s9)
   changed: (driven) from 583 to 618
   goals met: 5 of 15
29. (unload-truck package8 truck3 s9)
   deleted: (in package8 truck3)
   added: (at package8 s9)
   goals met: 6 of 15
30. (drive-truck truck3 s9 s2 driver3)
   deleted: (at truck3 s9)
   added: (at truck3 s2)
   changed: (driven) from 618 to 709
   goals met: 5 of 15
31. (unload-truck package9 truck3 s2)
   deleted: (in package9 truck3)
   added: (at package9 s2)
   goals met: 6 of 15
32. (load-truck package3 truck3 s2)
   deleted: (at package3 s2)
   added: (in package3 truck3)
   goals met: 6 of 15
33. (drive-truck truck3 s2 s9 driver3)
   deleted: (at truck3 s2)
   added: (at truck3 s9)
   changed: (driven) from 709 to 800
   goals met: 7 of 15
34. (walk driver2 p8-7 s7)
   deleted: (at driver2 p8-7)
   added: (at driver2 s7)
   changed: (walked) from 137 to 234
   goals met: 7 of 15
35. (board-truck driver2 truck2 s7)
   deleted: (at driver2 s7) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 7 of 15
36. (drive-truck truck3 s9 s8 driver3)
   deleted: (at truck3 s9)
   added: (at truck3 s8)
   changed: (driven) from 800 to 875
   goals met: 6 of 15
37. (drive-truck truck2 s7 s3 driver2)
   deleted: (at truck2 s7)
   added: (at truck2 s3)
   changed: (driven) from 875 to 963
   goals met: 6 of 15
38. (drive-truck truck2 s3 s8 driver2)
   deleted: (at truck2 s3)
   added: (at truck2 s8)
   changed: (driven) from 963 to 1039
   goals met: 7 of 15
39. (disembark-truck driver2 truck2 s8)
   deleted: (driving driver2 truck2)
   added: (at driver2 s8) (empty truck2)
   goals met: 7 of 15
40. (drive-truck truck3 s8 s3 driver3)
   deleted: (at truck3 s8)
   added: (at truck3 s3)
   changed: (driven) from 1039 to 1115
   goals met: 7 of 15
41. (unload-truck package4 truck3 s3)
   deleted: (in package4 truck3)
   added: (at package4 s3)
   goals met: 8 of 15
42. (board-truck driver2 truck1 s8)
   deleted: (at driver2 s8) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 8 of 15
43. (drive-truck truck1 s8 s4 driver2)
   deleted: (at truck1 s8)
   added: (at truck1 s4)
   changed: (driven) from 1115 to 1185
   goals met: 9 of 15
44. (drive-truck truck3 s3 s9 driver3)
   deleted: (at truck3 s3)
   added: (at truck3 s9)
   changed: (driven) from 1185 to 1253
   goals met: 10 of 15
45. (drive-truck truck3 s9 s6 driver3)
   deleted: (at truck3 s9)
   added: (at truck3 s6)
   changed: (driven) from 1253 to 1256
   goals met: 9 of 15
46. (unload-truck package3 truck3 s6)
   deleted: (in package3 truck3)
   added: (at package3 s6)
   goals met: 10 of 15
47. (unload-truck package6 truck3 s6)
   deleted: (in package6 truck3)
   added: (at package6 s6)
   goals met: 11 of 15
48. (drive-truck truck3 s6 s9 driver3)
   deleted: (at truck3 s6)
   added: (at truck3 s9)
   changed: (driven) from 1256 to 1259
   goals met: 12 of 15
49. (drive-truck truck3 s9 s2 driver3)
   deleted: (at truck3 s9)
   added: (at truck3 s2)
   changed: (driven) from 1259 to 1350
   goals met: 11 of 15
50. (disembark-truck driver3 truck3 s2)
   deleted: (driving driver3 truck3)
   added: (at driver3 s2) (empty truck3)
   goals met: 11 of 15
51. (unload-truck package2 truck3 s2)
   deleted: (in package2 truck3)
   added: (at package2 s2)
   goals met: 11 of 15
52. (board-truck driver3 truck4 s2)
   deleted: (at driver3 s2) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 11 of 15
53. (drive-truck truck4 s2 s3 driver3)
   deleted: (at truck4 s2)
   added: (at truck4 s3)
   changed: (driven) from 1350 to 1378
   goals met: 11 of 15
54. (disembark-truck driver3 truck4 s3)
   deleted: (driving driver3 truck4)
   added: (at driver3 s3) (empty truck4)
   goals met: 12 of 15
55. (drive-truck truck1 s4 s1 driver2)
   deleted: (at truck1 s4)
   added: (at truck1 s1)
   changed: (driven) from 1378 to 1447
   goals met: 11 of 15
56. (drive-truck truck1 s1 s2 driver2)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   changed: (driven) from 1447 to 1451
   goals met: 11 of 15
57. (load-truck package2 truck1 s2)
   deleted: (at package2 s2)
   added: (in package2 truck1)
   goals met: 11 of 15
58. (drive-truck truck1 s2 s1 driver2)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   changed: (driven) from 1451 to 1455
   goals met: 11 of 15
59. (unload-truck package2 truck1 s1)
   deleted: (in package2 truck1)
   added: (at package2 s1)
   goals met: 12 of 15
60. (board-truck driver3 truck4 s3)
   deleted: (at driver3 s3) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 11 of 15
61. (drive-truck truck4 s3 s2 driver3)
   deleted: (at truck4 s3)
   added: (at truck4 s2)
   changed: (driven) from 1455 to 1483
   goals met: 11 of 15
62. (disembark-truck driver3 truck4 s2)
   deleted: (driving driver3 truck4)
   added: (at driver3 s2) (empty truck4)
   goals met: 11 of 15
63. (board-truck driver3 truck3 s2)
   deleted: (at driver3 s2) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 11 of 15
64. (drive-truck truck3 s2 s9 driver3)
   deleted: (at truck3 s2)
   added: (at truck3 s9)
   changed: (driven) from 1483 to 1574
   goals met: 12 of 15
65. (drive-truck truck1 s1 s2 driver2)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   changed: (driven) from 1574 to 1578
   goals met: 12 of 15
66. (disembark-truck driver2 truck1 s2)
   deleted: (driving driver2 truck1)
   added: (at driver2 s2) (empty truck1)
   goals met: 12 of 15
67. (board-truck driver2 truck4 s2)
   deleted: (at driver2 s2) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 12 of 15
68. (drive-truck truck4 s2 s8 driver2)
   deleted: (at truck4 s2)
   added: (at truck4 s8)
   changed: (driven) from 1578 to 1636
   goals met: 13 of 15
69. (drive-truck truck3 s9 s2 driver3)
   deleted: (at truck3 s9)
   added: (at truck3 s2)
   changed: (driven) from 1636 to 1727
   goals met: 12 of 15
70. (disembark-truck driver3 truck3 s2)
   deleted: (driving driver3 truck3)
   added: (at driver3 s2) (empty truck3)
   goals met: 12 of 15
71. (disembark-truck driver2 truck4 s8)
   deleted: (driving driver2 truck4)
   added: (at driver2 s8) (empty truck4)
   goals met: 12 of 15
72. (board-truck driver3 truck1 s2)
   deleted: (at driver3 s2) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 12 of 15
73. (drive-truck truck1 s2 s8 driver3)
   deleted: (at truck1 s2)
   added: (at truck1 s8)
   changed: (driven) from 1727 to 1785
   goals met: 12 of 15
74. (walk driver2 s8 p2-8)
   deleted: (at driver2 s8)
   added: (at driver2 p2-8)
   changed: (walked) from 234 to 274
   goals met: 12 of 15
75. (walk driver2 p2-8 s2)
   deleted: (at driver2 p2-8)
   added: (at driver2 s2)
   changed: (walked) from 274 to 286
   goals met: 12 of 15
76. (board-truck driver2 truck3 s2)
   deleted: (at driver2 s2) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 12 of 15
77. (drive-truck truck3 s2 s9 driver2)
   deleted: (at truck3 s2)
   added: (at truck3 s9)
   changed: (driven) from 1785 to 1876
   goals met: 13 of 15
78. (drive-truck truck1 s8 s4 driver3)
   deleted: (at truck1 s8)
   added: (at truck1 s4)
   changed: (driven) from 1876 to 1946
   goals met: 14 of 15
79. (disembark-truck driver3 truck1 s4)
   deleted: (driving driver3 truck1)
   added: (at driver3 s4) (empty truck1)
   goals met: 14 of 15
80. (disembark-truck driver2 truck3 s9)
   deleted: (driving driver2 truck3)
   added: (at driver2 s9) (empty truck3)
   goals met: 14 of 15
81. (walk driver3 s4 p5-4)
   deleted: (at driver3 s4)
   added: (at driver3 p5-4)
   changed: (walked) from 286 to 348
   goals met: 14 of 15
82. (walk driver3 p5-4 s5)
   deleted: (at driver3 p5-4)
   added: (at driver3 s5)
   changed: (walked) from 348 to 430
   goals met: 14 of 15
83. (walk driver3 s5 p3-5)
   deleted: (at driver3 s5)
   added: (at driver3 p3-5)
   changed: (walked) from 430 to 507
   goals met: 14 of 15
84. (walk driver3 p3-5 s3)
   deleted: (at driver3 p3-5)
   added: (at driver3 s3)
   changed: (walked) from 507 to 554
   goals met: 15 of 15
